[
  {
    "name": "Barbie",
    "year": "2023",
    "plot": "No mundo mágico das Barbies, \"Barbieland\", uma das bonecas começa a perceber que não se encaixa como as outras. Depois de ser expulsa, ela parte para uma aventura no \"mundo real\", onde descobre que a beleza está no interior de cada um.",
    "image_url": "https://image.tmdb.org/t/p/original                /iuFNMS8U5cb6xfzi51Dbkovj7vM.jpg",
    "imdb_rating": 7.625,
    "popularity": 6058.224,
    "genres": "Comédia, Aventura, Fantasia",
    "languages": "",
    "production_companies": "LuckyChap Entertainment, Heyday Films, Mattel Films",
    "production_countries": "United Kingdom, United States of America"
  },
  {
    "name": "Matrix",
    "year": "1999",
    "plot": "Em um futuro próximo, Thomas Anderson (Keanu Reeves), um jovem programador de computador que mora em um cubículo escuro, é atormentado por estranhos pesadelos nos quais encontra-se conectado por cabos e contra sua vontade, em um imenso sistema de computadores do futuro. Em todas essas ocasiões, acorda gritando no exato momento em que os eletrodos estão para penetrar em seu cérebro. À medida que o sonho se repete, Anderson começa a ter dúvidas sobre a realidade. Por meio do encontro com os misteriosos Morpheus (Laurence Fishburne) e Trinity (Carrie-Anne Moss), Thomas descobre que é, assim como outras pessoas, vítima do Matrix, um sistema inteligente e artificial que manipula a mente das pessoas, criando a ilusão de um mundo real enquanto usa os cérebros e corpos dos indivíduos para produzir energia. Morpheus, entretanto, está convencido de que Thomas é Neo, o aguardado messias capaz de enfrentar o Matrix e conduzir as pessoas de volta à realidade e à liberdade.",
    "image_url": "https://image.tmdb.org/t/p/original                /lDqMDI3xpbB9UQRyeXfei0MXhqb.jpg",
    "imdb_rating": 8.205,
    "popularity": 75.9,
    "genres": "Ação, Ficção científica",
    "languages": "",
    "production_companies": "Village Roadshow Pictures, Groucho II Film Partnership, Silver Pictures, Warner Bros. Pictures",
    "production_countries": "United States of America"
  },
  {
    "name": "Matrix Resurrections",
    "year": "2021",
    "plot": "Em um mundo de duas realidades — a vida cotidiana e o que está por trás dela —, Thomas Anderson terá que escolher seguir o coelho branco mais uma vez. A escolha, embora seja uma ilusão, ainda é a única maneira de entrar ou sair da Matrix, que é mais forte, mais segura e mais perigosa do que nunca.",
    "image_url": "https://image.tmdb.org/t/p/original                /9DT4WVqZqBEI9Kub18gZ3m1D89m.jpg",
    "imdb_rating": 6.505,
    "popularity": 76.429,
    "genres": "Ficção científica, Ação, Aventura",
    "languages": "",
    "production_companies": "Warner Bros. Pictures, Village Roadshow Pictures, Venus Castina Productions",
    "production_countries": "Canada, Germany, United States of America"
  },
  {
    "name": "O Senhor dos Anéis: A Sociedade do Anel",
    "year": "2001",
    "plot": "Em uma terra fantástica e única, um hobbit recebe de presente de seu tio um anel mágico e maligno que precisa ser destruído antes que caia nas mãos do mal. Para isso, o hobbit Frodo tem um caminho árduo pela frente, onde encontra perigo, medo e seres bizarros. Ao seu lado para o cumprimento desta jornada, ele aos poucos pode contar com outros hobbits, um elfo, um anão, dois humanos e um mago, totalizando nove pessoas que formam a Sociedade do Anel.",
    "image_url": "https://image.tmdb.org/t/p/original                /omoMXT3Z7XrQwRZ2OGJGNWbdeEl.jpg",
    "imdb_rating": 8.4,
    "popularity": 88.956,
    "genres": "Aventura, Fantasia, Ação",
    "languages": "",
    "production_companies": "New Line Cinema, WingNut Films, The Saul Zaentz Company",
    "production_countries": "New Zealand, United States of America"
  }
]